module.exports = {
  alias: [
    ['a', "妖刀", "祕聞妖刀", "秘聞妖刀", "祕聞妖刀的秘笈", "秘聞妖刀的秘笈", "妖刀的秘笈"],
    ['b', "山兔", "祕聞山兔", "秘聞山兔", "祕聞山兔大暴走", "秘聞山兔大暴走", "山兔大暴走"],
    ['c', "紅葉", "祕聞紅葉", "秘聞紅葉", "祕聞紅葉的羈絆", "秘聞紅葉的羈絆", "紅葉的羈絆"],
    ['d', "河畔", "河童", "祕聞河畔", "秘聞河畔", "祕聞河童", "秘聞河童", "祕聞河畔童謠", "秘聞河畔童謠", "河畔童謠"],
    ['z', "御魂"],
    [1, "1", "第一章", "第1章", "食雀奇譚"],
    [2, "2", "第二章", "第2章", "幸福的彼岸"],
    [3, "3", "第三章", "第3章", "鳳凰林的占卜師"],
    [4, "4", "第四章", "第4章", "橋上的雨女"],
    [5, "5", "第五章", "第5章", "黑夜山的食髮鬼"],
    [6, "6", "第六章", "第6章", "似夢非夢"],
    [7, "7", "第七章", "第7章", "戀上鯉之美"],
    [8, "8", "第八章", "第8章", "櫻與桃"],
    [9, "9", "第九章", "第9章", "兔蛙茶和鍋"],
    [10, "10", "第十章", "第10章", "鬼為誰買醉"],
    [11, "11", "第十一章", "第11章", "染紅了的楓葉林"],
    [12, "12", "第十二章", "第12章", "另一個晴明"],
    [13, "13", "第十三章", "第13章", "箭與弓道"],
    [14, "14", "第十四章", "第14章", "夢境的邂逅"],
    [15, "15", "第十五章", "第15章", "陰界裂縫"],
    [16, "16", "第十六章", "第16章", "冥界審判"],
    [17, "17", "第十七章", "第17章", "陰陽逆反"],
    [18, "18", "第十八章", "第18章", "見習鬼使"],
    [18.5, "番外一", "番外1", "見習鬼使"],
    [19, "19", "第十九章", "第19章", "八崎大蛇的復活"]
  ],
  data: {
    'a':
`尚未新增妖刀的關卡資料`,
    'b':
`尚未新增山兔的關卡資料`,
    'c':
`尚未新增紅葉的關卡資料`,
    'd':
`尚未新增河童的關卡資料`,
    1: 
`天邪鬼綠   天邪鬼綠*1+跳跳犬*2
天邪鬼綠    天邪鬼綠*1+ 提燈小僧*2
提燈小僧    提燈小僧*1+燈籠鬼*2
提燈小僧    提燈小僧*1+燈籠鬼*2
BOSS九命貓  九命貓*3
經驗 240/600 金錢 200/290
挑戰：天邪鬼綠、九命貓`,
    2:
`帚神   帚神*1+盜墓小鬼*1+盜墓小鬼*1+寄生魂*1　
盜墓小鬼    盜墓小鬼*1+寄生魂*2
盜墓小鬼    盜墓小鬼*1燈籠鬼*2
寄生魂  寄生魂*2+燈籠鬼*2
寄生魂  寄生魂*1+盜墓小鬼*2
BOSS座敷童子    座敷童子*1+天邪鬼綠*2+天邪鬼青*1
經驗 280/640 金錢 210/300
挑戰：提燈小僧、座敷童子`,
    3:
`天邪鬼黃   兵傭*1+提燈小僧*1+童女*1
天邪鬼黃    天邪鬼黃*1+童女*3
兵傭    天邪鬼黃*1+塗壁*1+帚神*1
兵傭    兵傭*1+燈籠鬼*2+提燈小僧*1
赤舌    提燈小僧*2+燈籠鬼*2+鴉天狗*1
赤舌    赤舌*1+天邪鬼黃*1+童女*2+鴉天狗*1
BOSS鳳凰火  鳳凰火*1+天邪鬼赤*3
經驗 320/680 金錢 220/310
挑戰：天邪鬼黃、三尾狐、錢鼠`,
    4:
`帚神   帚神*1+塗壁*2
帚神    帚神*1+塗壁*2
帚神    帚神*1+傘妖*3
唐紙傘妖    唐紙傘妖*1+天邪鬼赤*3
唐紙傘妖    唐紙傘妖*1+塗壁*3
天邪鬼赤    天邪鬼赤*1+塗壁*3
天邪鬼赤    天邪鬼赤*1+傘妖*2
BOSS雨女   雨女*1+青蛙瓷器*1+帚神*2
經驗 360/720 金錢 230/320
挑戰：雨女、青蛙瓷器、管狐`,
    5:
`塗壁   (簡)黑豹*1+塗壁*1+天邪鬼赤*2(困)塗壁*2+天邪鬼赤*2
塗壁    塗壁*1+天邪鬼赤*3
帚神    帚神*1+天邪鬼赤*1+塗壁*2　
帚神  帚神*1+天邪鬼黃*2+天邪鬼赤*1
管狐    管狐*2+天邪鬼黃*2+寄生魂*1
管狐    管狐*1+天邪鬼綠*3+寄生魂*1
BOSS食發鬼  食發鬼*1+天邪鬼青*2+燈籠鬼*1
經驗 400/760 金錢 240/330
挑戰：帚神、食髮鬼`,
    6:
`燈籠鬼     燈籠鬼*1+帚神*3
燈籠鬼  燈籠鬼*1+帚神*3
天邪鬼青    天邪鬼青*1+天邪鬼綠*3
天邪鬼青    天邪鬼青*1+天邪鬼綠*3
蝴蝶精  蝴蝶精*1+天邪鬼赤*2+塗壁*1+三尾狐*1
蝴蝶精  蝴蝶精*1+天邪鬼赤*2+塗壁*1+三尾狐*1
BOSS巫蠱師  巫蠱師*1+天邪鬼綠*3
經驗 440/800 金錢 250/340
挑戰：燈籠鬼、巫蠱師、蝴蝶精`,
    7:
`鯉魚精     鯉魚精*3+帚神*1
鯉魚精  鯉魚精*1+帚神*3
河童    河童*1+塗壁*2+鯉魚精*1
河童    河童*1+燈籠鬼*1+跳跳犬*2
提燈小僧(左、中)    提燈小僧*1+跳跳犬*3+管狐*1　　
提燈小僧(右)    提燈小僧*1+鯉魚精*2+跳跳犬*1+管狐*1
BOSS妖狐    妖狐*2+座敷童子*2+塗壁*1+天邪鬼赤*2+寄生魂*1
經驗 480/840 金錢 260/350
挑戰：天邪鬼赤、河童、鯉魚精`,
    8:
`天邪鬼綠   天邪鬼綠*1+天邪鬼青*1+天邪鬼黃*2
天邪鬼綠    天邪鬼綠*1+天邪鬼青*1+天邪鬼黃*2
唐紙傘妖    唐紙傘妖*1+帚神*3
唐紙傘妖    唐紙傘妖*1+帚神*2+山童*1
桃花妖  桃花妖*1+塗壁*2+帚神*1+雪女*1
桃花妖  桃花妖*1+塗壁*3+雪女*1
BOSS桃花妖  桃花妖*2+提燈小僧*2+天邪鬼青*1+蝴蝶精*2+帚神*1
經驗 520/880 金錢 270/360
挑戰：唐紙傘妖、桃花妖`,
    9:
`提燈小鬼   提燈小僧*1+燈籠鬼*3
提燈小鬼    提燈小僧*1+鐵鼠*2+燈籠鬼*1
鐵鼠    鐵鼠*1+帚神*3
鐵鼠    鐵鼠*2+帚神*2
山兔    山兔*4+鴉天狗*1
山兔    山兔*3+鐵鼠*1+鴉天狗*1
BOSS孟婆    孟婆*2+餓鬼*3+鴉天狗*2+燈籠鬼*1
經驗 500/920 金錢 280/370
挑戰：天邪鬼青、山兔`,
    10:
`丑時之女   丑時之女*1+傀儡師*1+天邪鬼青*2　
丑時之女    丑時之女*1+傀儡師*1+天邪鬼青*2
覺  覺*1+狸貓*3
覺  覺*1+座敷童子*2+赤舌*1+犬神*1　
傀儡師  傀儡師*1+狸貓*2+覺*1　
傀儡師  傀儡師*1+座敷童子*2+覺*1+犬神*1
BOSS酒吞    酒吞*2+食發鬼*2+跳跳哥哥*1+兵傭*1+骨女*2
經驗 540/960 金錢 290/380
挑戰：武士之靈、丑時之女`,
    11:
`武士之靈   武士之靈*1+寄生魂*3
武士之靈    武士之靈*1+獨眼小僧*3
獨眼小僧    獨眼小僧*2+塗壁*1+天邪鬼赤*2
獨眼小僧    獨眼小僧*2+管狐*1+天邪鬼赤*2
餓鬼(後)    餓鬼*1+管狐*2+塗壁*1　
餓鬼(右)    餓鬼*3+管狐*1
BOSS鬼女紅葉    鬼女紅葉*2+天邪鬼青*2+童女*1+骨女*1+覺*2
經驗 580/1000 金錢 300/390
挑戰：寄生魂、餓鬼`,
    12:
`海坊主     海坊主*1+塗壁*2+帚神*1
海坊主  海坊主*1+鴉天狗*2+塗壁*1
童女    童女*1+提燈小僧*2+盜墓小鬼*1+雪女*1
童女    童女*3+盜墓小鬼*1+雪女*1
童男    童男*1+鴉天狗*2+天邪鬼黃*2
童男    童男*1+鴉天狗*2+童女*1
BOSS雪女    雪女*2+武士之靈*2+寄生魂*1+跳跳哥哥*2+跳跳妹妹*1
金錢 620/1040 金錢 310/400
挑戰：童男、童女`,
    13:
`餓鬼   餓鬼*1天邪鬼赤*3
餓鬼    餓鬼*1+天邪鬼赤*3
餓鬼    餓鬼*1+天邪鬼赤*3+首無*1　
傘妖    傘妖*1+天邪鬼綠*2+天邪鬼赤*1　
傘妖    傘妖*1+天邪鬼綠*2+天邪鬼赤*1
傘妖    傘妖*1+天邪鬼綠*2+天邪鬼赤*1+首無*1
BOSS首無    首無*1+骨女*1+山兔*1+燈籠鬼*1
經驗 640/1080 金錢 320/410
挑戰：塗璧、兵俑`,
    14:
`帚神(All)     帚神*1+天邪鬼赤*3
塗壁(左二)   塗壁*6
塗壁  塗壁*6+食夢貘*1　
BOSS食夢貘  食夢貘*5+天邪鬼赤*3
經驗 680/1120 金錢 330/420
挑戰：盜墓小鬼、狸貓`,
    15:
`天邪鬼綠(都是)     天邪鬼綠*1+天邪鬼赤*2+赤舌*1
提燈小僧(前2隻)     提燈小僧*1+九命貓*2+赤舌*1
提燈小僧(後2隻)     提燈小僧*1+九命貓*2+赤舌*1+大天狗*1
BOSS跳跳妹妹    跳跳妹妹*1+九命貓*3
經驗 720/1160 金錢 340/430
挑戰：跳跳弟弟、跳跳妹妹`,
    16:
`餓鬼(All)     惡鬼*1+山兔*1+山童*2　　
赤舌    赤舌*1+寄生魂*3
赤舌  赤舌*2+寄生魂*3
BOSS判官  判官*1+鬼使黑*1+鬼使白*1
經驗 760/1200 金錢 350/440
挑戰：赤舌、山童
    17:
`鴉天狗    鴉天狗*1+風小麒麟*3
狸貓    狸貓*1+火小麒麟*3
狸貓    狸貓*1+火小麒麟*3
鴉天狗    鴉天狗*1+風小麒麟*3
鴉天狗    鴉天狗*1+風小麒麟*3
狸貓    狸貓*1+火小麒麟*3+暗鳳凰*1
BOSS荒川之主    荒川之主*1+燈籠鬼*1+骨女*1+山兔*1
經驗 800/1240 金錢 360/450
挑戰：螢草、鴉天狗`,
    18:
`九命貓     九命貓*6
三尾狐  三尾狐*2+九命貓*2+大天狗*1
三尾狐  三尾狐*2+九命貓*2
九命貓  九命貓*6
三尾狐  三尾狐*2+九命貓*2
九命貓  九命貓*6
BOSS大天狗  大天狗*1+鴉天狗*3
經驗 840/1280 金錢 370/460
挑戰：獨眼小僧、覺、鐮鼬`,
    18.5:
`尚無資料，如有資料請透過 留言 提交`,
    19:
`尚無資料，如有資料請透過 留言 提交`,
    'z1':
`三尾狐、天邪鬼青、天邪鬼青
山童、塗壁、塗壁
八歧大蛇、天邪鬼赤、天邪鬼赤`,
    'z2':
`妖狐、河童、河童
吸血姬、兵俑、兵俑
八歧大蛇、童女、童女`,
    'z3':
`桃花妖、蝴蝶精、蝴蝶精
海坊主、鯉魚精、鯉魚精
八歧大蛇、座敷童子、座敷童子`,
    'z4':
`犬神、童男、童男
大天狗、鬼使黑、鬼使黑
八歧大蛇、食夢貘、食夢貘`,
    'z5':
`鐮鼬、骨女、骨女
傀儡師、跳跳哥哥、跳跳哥哥
八歧大蛇、孟婆、孟婆`,
    'z6':
`雨女、座敷童子、座敷童子
閻魔、鴉天狗、鴉天狗
八歧大蛇、骨女、骨女`,
    'z7':
`鳳凰火、醜時之女、醜時之女
酒吞童子、妖琴師、妖琴師
八歧大蛇、荒川之主、荒川之主`,
    'z8':
`餓鬼、判官、判官
蝴蝶精、白狼、白狼
八歧大蛇、茨木童子、茨木童子`,
    'z9':
`螢草、鯉魚精、鯉魚精
清姬、食夢貘、食夢貘
八歧大蛇、兩面佛、兩面佛`,
    'z10':
`覺、螢草、螢草
青行燈、酒吞童子、酒吞童子
八歧大蛇、大天狗、大天狗`
  }
}
