var wanted = {
"大天狗" : 
`第十五章 提燈小僧3 x1
第十八章 三尾狐1 x1 BOSS x1
祕聞妖刀 第8~10層 x1
祕聞河畔(陸) 第9層 x1`,
"閻魔" : 
`祕聞河畔(陸) 第9層 x1`,
"酒吞童子" : 
`第十章 BOSS x2
番外一(困) 酒吞童子x1
祕聞紅葉 第9~10層 x1`,
"茨木童子" : 
`祕聞河畔(陸) 第7層 x1`,
"荒川之主" : 
`第十七章 BOSS x1
祕聞河畔(陸) 第7層`,
"孟婆" : 
`第九章 BOSS x2
祕聞河畔(陸) 第5層 x1`,
"鬼使黑" : 
`第十六章 BOSS x1
番外一 BOSS x1
祕聞妖刀 x1
祕聞河畔(陸) x3`,
"鬼使白" :
`第十六章 BOSS x1
番外一 BOSS x1
祕聞妖刀 第7層 x1
祕聞河畔(陸) 第6層 x1`,
"骨女" :
`第十章 BOSS x2
第十一章 BOSS x1
第十三章 BOSS x1
第十七章 BOSS x1
祕聞紅葉 第5層 x1
祕聞妖刀 第5層 x1
祕聞河畔(台) 第7層 x2`,
"妖狐" :
`第七章 BOSS x2
祕聞妖刀 第10層 x2
祕聞河畔(台陸) 第9~10層 x1`,
"犬神" :
`第十章 傀儡師2 x1 覺2 x1
番外一 古籠火123 x3
祕聞紅葉 第8~10層 x1`,
"鐮鼬" :
`祕聞河畔 第3層 x2
祕聞河畔(台) 第3層 x1
祕聞河畔(陸) 第4層 x1
第十八章挑戰 x14`,
"雪女" :
`第八章 櫻花妖12 x1
第十二章 童女12 x1 BOSS x2
祕聞紅葉 第6層 x1
祕聞河畔(台) 第5層 x2`,
"判官" :
`第十六章 BOSS x1
祕聞妖刀 第7層 x1
祕聞河畔(陸) 第7層 x1`,
"清姬" :
`第十九章 清姬12 x1 絡新婦12 x2 BOSS x2
祕聞妖刀 第6層 x1`,
"海坊主" :
`第十二章 海坊主12 x1
祕聞河畔(台) 第9層 x3
祕聞河畔(陸) 第8層 x3`,
"傀儡師" :
`第十章 丑時之女12 x1 傀儡師12 x1
祕聞妖刀 第5層 x1
祕聞河畔(台) 第4層 x2`,
"桃花妖" :
`第八章 BOSS x1
祕聞紅葉 第8~10層 x1
祕聞妖刀 第6、10層 x1
祕聞河畔(台) 第10層 x2
祕聞河畔(陸) 第5層 x1 第10層 x2`,
"櫻花妖" :
`第八章 櫻花妖12 x1 BOSS x1
祕聞妖刀 第6層 x1
祕聞河畔(台) 第10層 x1
祕聞河畔(陸) 第5、10層 x1`,
"吸血姬" :
`祕聞紅葉 第7層 x2 第10層 x1
祕聞河畔(陸) 第8層 x2`,
"食夢貘" :
`第十四章 塗壁3 x1 BOSS x5
祕聞河畔(陸) 第7層 x1`,
"鳳凰火" :
`第三章 BOSS x1
祕聞河畔(陸) 第5層 x1`,
"二口女" :
`第十九章 清姬1 x1 清姬2 x3 二口女1 x1 二口女2 x4 二口女3 x3 BOSS x1
祕聞妖刀 第5層 x1
祕聞河畔(台) 第6層 x2`,
"鬼女紅葉" :
`第十一章 BOSS x2
番外一 鬼女紅葉12 x1
祕聞紅葉 各層 x1
祕聞河畔(陸) 第5層 x1`
}
module.exports = wanted;
